QA output created by 617
dbpmda> help
help [ command ]

attr name [value]
attr attr# [value]
children metric-name
close
debug all | none
debug [-]flag [ [-]flag ... ] (- prefix to clear)
desc metric
fetch metric [ metric ... ]
getdesc on | off
getiname on | off
instance indom# [ number | name | "name" ]
label context
label domain
label indom indom#
label cluster cluster#
label item metric
label instances indom#
name pmid#
namespace fname
open dso dsoname init_routine [ domain# ]
open pipe execname [ arg ... ]
open socket unix sockname
open socket inet port#|service
open socket ipv6 port#|service
pmid metric-name
profile indom# [ all | none ]
profile indom# [ add | delete ] number
quit
status
store metric "value"
text metric
text indom indom#
timer on | off
traverse metric-name
wait seconds
watch logfilename

dbpmda> status

Namespace:              (default)
PMDA:                   none
Debug options:          (none)
Timer:                  off
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> #a comment, this should be ignored
dbpmda> #test the debug and status commands
dbpmda> debug# a command with a trailing comment
debug all | none
debug [-]flag [ [-]flag ... ] (- prefix to clear)
dbpmda> help debug

debug all | none
debug [-]flag [ [-]flag ... ] (- prefix to clear)

Specify which debugging options should be active (see pmdbg(1)).  Options
may be specified by name (or number for the old bit-field options), with
multiple options separated by white space.  All options may be selected or
deselected if 'all' or 'none' is specified.  The current setting is
displayed by the status command.


dbpmda> debug all
dbpmda> status

Namespace:              (default)
PMDA:                   none
Debug options:          (all)
Timer:                  off
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> debug none
dbpmda> debug appl0 timecontrol
dbpmda> status

Namespace:              (default)
PMDA:                   none
Debug options:          appl0 timecontrol
Timer:                  off
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> debug none
dbpmda> status

Namespace:              (default)
PMDA:                   none
Debug options:          (none)
Timer:                  off
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> debug blah
                 ^ at or near here
Error: Bad debug flag (blah)
Type 'help' for a list of commands.
dbpmda> debug none
dbpmda> debug 1 blah
                   ^ at or near here
Error: Bad debug flag (blah)
Type 'help' for a list of commands.
dbpmda> debug none
dbpmda> debug blah fetch
                  ^ at or near here
Error: Bad debug flag (blah)
Type 'help' for a list of commands.
dbpmda> debug none
dbpmda> open pipe /blah/this_file_should_not_exist
openpmda: stat /blah/this_file_should_not_exist failed: No such file or directory
dbpmda> status

Namespace:              (default)
PMDA:                   none
Debug options:          (none)
Timer:                  off
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> open dso /blah/this_file_should_not_exist blah_init 128
opendso: /blah/this_file_should_not_exist: No such file or directory
dbpmda> status

Namespace:              (default)
PMDA:                   none
Debug options:          (none)
Timer:                  off
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> open pipe $PCP_PMDAS_DIR/sample/pmdasample -d 29 -l TMP.log
Start pmdasample PMDA: $PCP_PMDAS_DIR/sample/pmdasample -d 29 -l TMP.log
dbpmda> status

Namespace:              (default)
PMDA:                   $PCP_PMDAS_DIR/sample/pmdasample
Connection:             daemon (pid: PID)
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> #test the desc command
dbpmda> desc
desc metric
dbpmda> desc 29.0.6
PMID: 29.0.6
    Data Type: 32-bit int  InDom: 29.2 0x7400002
    Semantics: instant  Units: none
dbpmda> desc sample.bin
PMID: 29.0.6
    Data Type: 32-bit int  InDom: 29.2 0x7400002
    Semantics: instant  Units: none
dbpmda> #test the instance command
dbpmda> instance
instance indom# [ number | name | "name" ]
dbpmda> instance 29.2
pmInDom: 29.2
[  0] inst: 100 name: "bin-100"
[  1] inst: 200 name: "bin-200"
[  2] inst: 300 name: "bin-300"
[  3] inst: 400 name: "bin-400"
[  4] inst: 500 name: "bin-500"
[  5] inst: 600 name: "bin-600"
[  6] inst: 700 name: "bin-700"
[  7] inst: 800 name: "bin-800"
[  8] inst: 900 name: "bin-900"
dbpmda> instance 29.2 300
pmInDom: 29.2
[  0] name: "bin-300"
dbpmda> instance 29.2 "bin-100"
pmInDom: 29.2
[  0] inst: 100
dbpmda> instance 29.2 "bin
                         ^ at or near here
Error: Expected "
Type 'help' for a list of commands.
dbpmda> instance "bin
                ^ at or near here
Error: Syntax error
Type 'help' for a list of commands.
dbpmda> instance 30.3
pmInDom: 30.3
Error PDU: Unknown or illegal instance domain identifier
dbpmda> instance 29
pmInDom: 0.29
Error PDU: Unknown or illegal instance domain identifier
dbpmda> instance -1
pmInDom: PM_INDOM_NULL
Error PDU: Unknown or illegal instance domain identifier
dbpmda> #test the timer command
dbpmda> timer
timer on | off
dbpmda> timer on
dbpmda> status

Namespace:              (default)
PMDA:                   $PCP_PMDAS_DIR/sample/pmdasample
Connection:             daemon (pid: PID)
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  on
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> timer off
dbpmda> status

Namespace:              (default)
PMDA:                   $PCP_PMDAS_DIR/sample/pmdasample
Connection:             daemon (pid: PID)
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                off
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> #test the fetch command
dbpmda> getdesc on
dbpmda> fetch
fetch metric [ metric ... ]
dbpmda> fetch 29.0.6
PMID(s): 29.0.6
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.6 (sample.dupnames.five.bin or sample.dupnames.four.bin or sample.dupnames.three.bin or sample.dupnames.two.bin or sample.bin): numval: 9 valfmt: 0 vlist[]:
    inst [100 or ???] value 100
    inst [200 or ???] value 200
    inst [300 or ???] value 300
    inst [400 or ???] value 400
    inst [500 or ???] value 500
    inst [600 or ???] value 600
    inst [700 or ???] value 700
    inst [800 or ???] value 800
    inst [900 or ???] value 900
dbpmda> fetch sample.bin 29.0.5
PMID(s): 29.0.6 29.0.5
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 2
  29.0.6 (sample.dupnames.five.bin or sample.dupnames.four.bin or sample.dupnames.three.bin or sample.dupnames.two.bin or sample.bin): numval: 9 valfmt: 0 vlist[]:
    inst [100 or ???] value 100
    inst [200 or ???] value 200
    inst [300 or ???] value 300
    inst [400 or ???] value 400
    inst [500 or ???] value 500
    inst [600 or ???] value 600
    inst [700 or ???] value 700
    inst [800 or ???] value 800
    inst [900 or ???] value 900
  29.0.5 (sample.dupnames.four.colour or sample.colour): numval: 3 valfmt: 0 vlist[]:
    inst [0 or ???] value 101
    inst [1 or ???] value 202
    inst [2 or ???] value 303
dbpmda> fetch blah
                 ^ at or near here
Error: Unknown metric name
Type 'help' for a list of commands.
dbpmda> fetch 29
Warning: PMID (0.0.29) is not defined in the PMNS
PMID(s): 0.0.29
Error PDU: Unknown or illegal metric identifier
dbpmda> fetch 0.29
Warning: PMID (0.0.29) is not defined in the PMNS
PMID(s): 0.0.29
Error PDU: Unknown or illegal metric identifier
dbpmda> fetch 0.1.2
Warning: PMID (0.1.2) is not defined in the PMNS
PMID(s): 0.1.2
Error PDU: Unknown or illegal metric identifier
dbpmda> #test the profile command
dbpmda> profile
profile indom# [ all | none ]
profile indom# [ add | delete ] number
dbpmda> profile 29.2 none
dbpmda> status

Namespace:              (default)
PMDA:                   $PCP_PMDAS_DIR/sample/pmdasample
Connection:             daemon (pid: PID)
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                on
Getiname:               off

Dump Instance Profile state=INCLUDE, 1 profiles
	Profile [0] indom=121634818 [29.2] state=EXCLUDE 0 instances

dbpmda> fetch 29.0.6
PMID(s): 29.0.6
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.6 (sample.dupnames.five.bin or sample.dupnames.four.bin or sample.dupnames.three.bin or sample.dupnames.two.bin or sample.bin): No values returned!
dbpmda> profile 29.2 add 200
dbpmda> status

Namespace:              (default)
PMDA:                   $PCP_PMDAS_DIR/sample/pmdasample
Connection:             daemon (pid: PID)
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                on
Getiname:               off

Dump Instance Profile state=INCLUDE, 1 profiles
	Profile [0] indom=121634818 [29.2] state=EXCLUDE 1 instances
		Instances: [200]

dbpmda> fetch 29.0.6
PMID(s): 29.0.6
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.6 (sample.dupnames.five.bin or sample.dupnames.four.bin or sample.dupnames.three.bin or sample.dupnames.two.bin or sample.bin): numval: 1 valfmt: 0 vlist[]:
    inst [200 or ???] value 200
dbpmda> profile 29.2 add 250
dbpmda> status

Namespace:              (default)
PMDA:                   $PCP_PMDAS_DIR/sample/pmdasample
Connection:             daemon (pid: PID)
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                on
Getiname:               off

Dump Instance Profile state=INCLUDE, 1 profiles
	Profile [0] indom=121634818 [29.2] state=EXCLUDE 2 instances
		Instances: [200] [250]

dbpmda> fetch 29.0.6
PMID(s): 29.0.6
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.6 (sample.dupnames.five.bin or sample.dupnames.four.bin or sample.dupnames.three.bin or sample.dupnames.two.bin or sample.bin): numval: 1 valfmt: 0 vlist[]:
    inst [200 or ???] value 200
dbpmda> profile 29.2 add 300
dbpmda> status

Namespace:              (default)
PMDA:                   $PCP_PMDAS_DIR/sample/pmdasample
Connection:             daemon (pid: PID)
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                on
Getiname:               off

Dump Instance Profile state=INCLUDE, 1 profiles
	Profile [0] indom=121634818 [29.2] state=EXCLUDE 3 instances
		Instances: [200] [250] [300]

dbpmda> fetch 29.0.6
PMID(s): 29.0.6
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.6 (sample.dupnames.five.bin or sample.dupnames.four.bin or sample.dupnames.three.bin or sample.dupnames.two.bin or sample.bin): numval: 2 valfmt: 0 vlist[]:
    inst [200 or ???] value 200
    inst [300 or ???] value 300
dbpmda> profile 29.2 delete 200
dbpmda> status

Namespace:              (default)
PMDA:                   $PCP_PMDAS_DIR/sample/pmdasample
Connection:             daemon (pid: PID)
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                on
Getiname:               off

Dump Instance Profile state=INCLUDE, 1 profiles
	Profile [0] indom=121634818 [29.2] state=EXCLUDE 2 instances
		Instances: [250] [300]

dbpmda> fetch 29.0.6
PMID(s): 29.0.6
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.6 (sample.dupnames.five.bin or sample.dupnames.four.bin or sample.dupnames.three.bin or sample.dupnames.two.bin or sample.bin): numval: 1 valfmt: 0 vlist[]:
    inst [300 or ???] value 300
dbpmda> profile 29.2 all
dbpmda> status

Namespace:              (default)
PMDA:                   $PCP_PMDAS_DIR/sample/pmdasample
Connection:             daemon (pid: PID)
PMDA PMAPI Version:     2
Debug options:          (none)
Timer:                  off
Getdesc:                on
Getiname:               off

Dump Instance Profile state=INCLUDE, 1 profiles
	Profile [0] indom=121634818 [29.2] state=INCLUDE 0 instances

dbpmda> fetch 29.0.6
PMID(s): 29.0.6
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.6 (sample.dupnames.five.bin or sample.dupnames.four.bin or sample.dupnames.three.bin or sample.dupnames.two.bin or sample.bin): numval: 9 valfmt: 0 vlist[]:
    inst [100 or ???] value 100
    inst [200 or ???] value 200
    inst [300 or ???] value 300
    inst [400 or ???] value 400
    inst [500 or ???] value 500
    inst [600 or ???] value 600
    inst [700 or ???] value 700
    inst [800 or ???] value 800
    inst [900 or ???] value 900
dbpmda> #test the text command
dbpmda> text
text metric
text indom indom#
dbpmda> text 29.0.6
PMID: 29.0.6
[Several constant instances]
9 instances labelled "bin-100" thru "bin-900", each with an
initial value of 100 thru 900.

pmstore(1) may be used to change the values of some or all of
the instances, but note this will also change the values of the
metrics that share the same underlying values, i.e. sample.bucket,
sample.part_bin, sample.bogus_bin, sample.scramble.bin
sample.long.bin, sample.long.bin_ctr, sample.ulong.bin,
sample.ulong.bin_ctr, sample.longlong.bin, sample.longlong.bin_ctr,
sample.ulonglong.bin, sample.ulonglong.bin_ctr, sample.float.bin,
sample.float.bin_ctr, sample.double.bin, sample.double.bin_ctr
and sample.string.bin.
dbpmda> text indom 29.2
pmInDom: 29.2
[Instance domain "bin" for sample PMDA]
Universally 9 instances numbered 100 .. 900 in steps of 100, and named
"bin-100" .. "bin-900"
dbpmda> text indom 29.50
pmInDom: 29.50
Error PDU: Oneline or help text is not available
Error PDU: Oneline or help text is not available
dbpmda> text blah 29.2
                 ^ at or near here
Error: Unknown metric name
Type 'help' for a list of commands.
dbpmda> #test the store command
dbpmda> store
store metric "value"
dbpmda> store 29.0.36 "42"
PMID: 29.0.36
Getting description...
Getting Result Structure...
29.0.36: 2 -> 42
Sending Result...
dbpmda> store 29.0.36 '43'
PMID: 29.0.36
Getting description...
Getting Result Structure...
29.0.36: 42 -> 43
Sending Result...
dbpmda> fetch sample.write_me
PMID(s): 29.0.36
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.36 (sample.dupnames.three.write_me or sample.dupnames.two.write_me or sample.write_me): numval: 1 valfmt: 0 vlist[]:
   value 43
dbpmda> store 29.0.36
                    ^ at or near here
Error: Syntax error
Type 'help' for a list of commands.
dbpmda> store 29.0.36 "57.3"
PMID: 29.0.36
Getting description...
Getting Result Structure...
Error: Value "57.3" is incompatible with metric type (PM_TYPE_32)
dbpmda> store 29.0.36 '57.3'
PMID: 29.0.36
Getting description...
Getting Result Structure...
Error: Value "57.3" is incompatible with metric type (PM_TYPE_32)
dbpmda> store 20.0.36 Warning: PMID (20.0.36) is not defined in the PMNS
4
                      ^ at or near here
Error: Syntax error
Type 'help' for a list of commands.
dbpmda> store sample.write_me "Hello there"
PMID: 29.0.36
Getting description...
Getting Result Structure...
Error: Value "Hello there" is incompatible with metric type (PM_TYPE_32)
dbpmda> fetch sample.write_me
PMID(s): 29.0.36
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.36 (sample.dupnames.three.write_me or sample.dupnames.two.write_me or sample.write_me): numval: 1 valfmt: 0 vlist[]:
   value 43
dbpmda> store sample.string.write_me "Hello I'm here"
PMID: 29.0.32
Getting description...
Getting Result Structure...
29.0.32: "13" -> "Hello I'm here"
Sending Result...
dbpmda> fetch sample.string.write_me
PMID(s): 29.0.32
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.32 (sample.string.write_me): numval: 1 valfmt: 1 vlist[]:
   value "Hello I'm here"
dbpmda> store sample.string.write_me '"hello world" to you too'
PMID: 29.0.32
Getting description...
Getting Result Structure...
29.0.32: "Hello I'm here" -> ""hello world" to you too"
Sending Result...
dbpmda> fetch sample.string.write_me
PMID(s): 29.0.32
__pmResult dump from ADDR timestamp: 0.000000000 TIMEZONE numpmid: 1
  29.0.32 (sample.string.write_me): numval: 1 valfmt: 1 vlist[]:
   value ""hello world" to you too"
dbpmda> store 29.0.20 "3"
PMID: 29.0.20
Getting description...
Getting Result Structure...
29.0.20: 1 -> 3
Sending Result...
Error PDU: No permission to perform requested operation
dbpmda> store 0.0.0 Warning: PMID (0.0.0) is not defined in the PMNS
"5"
PMID: 0.0.0
Getting description...
Error PDU: Unknown or illegal metric identifier
dbpmda> store sample.aggregate.write_me "foo bar"
PMID: 29.0.35
Getting description...
Getting Result Structure...
Error: dbpmda does not support storing into AGGREGATE metrics
dbpmda> store sample.event.records "foo bar"
PMID: 29.0.136
Getting description...
Getting Result Structure...
Error: dbpmda does not support storing into EVENT metrics
dbpmda> #test the close and open commands
dbpmda> close
dbpmda> status

Namespace:              (default)
PMDA:                   none
Debug options:          (none)
Timer:                  off
Getdesc:                on
Getiname:               off

Dump Instance Profile state=INCLUDE, 1 profiles
	Profile [0] indom=121634818 [29.2] state=INCLUDE 0 instances

dbpmda> open dso PMDADSO sample_init 30
dbpmda> status

Namespace:              (default)
PMDA:                   PMDADSO
Connection:             dso
DSO Interface Version:  N
PMDA PMAPI Version:     4
Debug options:          (none)
Timer:                  off
Getdesc:                on
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> close
dbpmda> status

Namespace:              (default)
PMDA:                   none
Debug options:          (none)
Timer:                  off
Getdesc:                on
Getiname:               off

Dump Instance Profile state=INCLUDE, 0 profiles

dbpmda> #other
dbpmda> blah
           ^ at or near here
Error: Unrecognized command
Type 'help' for a list of commands.
dbpmda> quit
